Repository: guh0613/ruri
Catalog: Sources/RuriLocalization/Resources/CLIExperience.xcstrings
Source language: zh_hans
Languages: en

# CLIExperience.completed
source: 已完成
en: Completed

# CLIExperience.configFields
source: 配置字段（? 表示允许 null；空字符串与 null 不同）：
en: Configuration fields (? allows null; an empty string is different from null):

# CLIExperience.configPreview
source: 预览：将更新配置
en: Preview: configuration changes

# CLIExperience.configRules
source: 配置作用域：app、defaults、instance:<uuid>。set 的值使用 JSON 字面量（字符串需保留双引号）；apply --file - 从 stdin 读取补丁。inherit 按组恢复继承，--if-revision 防止覆盖并发修改。
en: Scopes: app, defaults, instance:<uuid>. set accepts a JSON literal (retain double quotes around strings); apply --file - reads a patch from stdin. inherit restores group inheritance; --if-revision guards concurrent changes.

# CLIExperience.configUnchanged
source: 配置未变化
en: Configuration unchanged

# CLIExperience.configUpdated
source: 配置已更新
en: Configuration updated

# CLIExperience.discovery
source: 发现命令：ruri help <资源> 查看整组用法；ruri help --all 查看完整速查表。
en: Discovery: ruri help <resource> shows a whole command group; ruri help --all shows the complete cheat sheet.

# CLIExperience.empty
source: 没有匹配的结果。
en: No matching results.

# CLIExperience.formats
source: 默认输出简洁文本；--json 返回稳定结构；--output ndjson 返回事件流。--data-dir <路径> 指定数据目录；--language <语言>；--quiet 隐藏进度。
en: Default: concise text. --json: stable structured result. --output ndjson: event stream. --data-dir <path>: data directory. --language en|zh-Hans: message language (default: en). --quiet: hide progress.

# CLIExperience.fullDetails
source: 使用 --json 查看完整字段。
en: Use --json for all fields.

# CLIExperience.fullSchema
source: 展开目录中所有命令的完整结构，输出可能很长
en: Expand every matching command's full schema; output may be large.

# CLIExperience.helpAll
source: 列出全部命令的精简用法
en: Show a concise index of every command.

# CLIExperience.hiddenChanges
source: 脱敏后无可显示的差异。
en: Changes are hidden by redaction.

# CLIExperience.inputSchema
source: 只返回命令输入结构；config apply 同时包含补丁结构
en: Return only the command input schema, including the patch schema for config apply.

# CLIExperience.listRules
source: 列表默认最多 50 项，--limit <1…1000> / --offset <数量> 分页，--all 返回全部。
en: Lists return up to 50 items by default. Paginate with --limit <1…1000> / --offset <count>, or use --all.

# CLIExperience.more
source: 还有更多：%@
en: More results: %@

# CLIExperience.nextAction
source: 下一步：%@
en: Next: %@

# CLIExperience.outputSchema
source: 只返回命令结果结构
en: Return only the command result schema.

# CLIExperience.page
source: 显示 %lld 项；起始位置 %2$lld。
en: Showing %lld items, offset %2$lld.

# CLIExperience.preview
source: 预览（未执行）
en: Preview (not executed)

# CLIExperience.previewMessage
source: 预览（未执行）：%1$@
en: Preview (not executed): %1$@

# CLIExperience.retryable
source: 此操作可以重试。
en: This operation can be retried.

# CLIExperience.rules
source: 目标使用 list 返回的完整 ID；修改需明确目标，selected 查询当前选择。支持 --dry-run 的命令可预览；删除等操作需 --yes，覆盖另需 --replace。
en: Use complete IDs from list results. Mutations require explicit targets; selected reads the current selection. Use --dry-run where supported. Deletion requires --yes; replacement also requires --replace.

# CLIExperience.schemaHint
source: 严格结构：ruri schema <资源> <动作> --input 或 --output-schema；配置可加 --scope app|defaults|instance。
en: Strict schemas: ruri schema <resource> <action> --input or --output-schema; configuration supports --scope app|defaults|instance.

# CLIExperience.schemaScope
source: 只查询指定配置作用域的字段：app、defaults 或 instance
en: Limit configuration fields to app, defaults, or instance.

# CLIExperience.schemaSelection
source: --input、--output-schema 和 --scope 需要指定完整命令；--scope 仅适用于配置命令的输入。
en: --input, --output-schema, and --scope require an exact command. --scope applies only to configuration inputs.

# CLIExperience.total
source: 共 %lld 项。
en: Total: %lld.

# CLIExperience.unchanged
source: 未变化
en: Unchanged

# CLIExperience.unknownHelp
source: 找不到命令：%@。使用 ruri help --all 查看命令目录。
en: Unknown command: %@. Run ruri help --all to list commands.

# CLIExperience.warning
source: 警告：%@
en: Warning: %@
